(ns yes-she-codes.db.compra)

(def compras [["2022-01-01" 129.90 "Outback" "Alimentação" "1234 1234 1234 1234"]
              ["2022-01-01" 80.90 "Dentista" "Saúde" "1234 1234 1234 1234"]
              ["2022-02-01" 40.90 "Cinema" "Lazer" "1234 1234 1234 1234"]
              ["2022-04-01" 60.90 "Show" "Lazer" "3939 3939 3939 3939"]
              ["2022-04-01" 10.90 "Ifood" "Alimentação" "3939 3939 3939 3939"]
              ["2022-04-01" 90.90 "Alura" "Educação" "1234 1234 1234 1234"]
              ["2022-04-01" 400.00 "Tok&Stock" "Casa" "6655 6655 6655 6655"]
              ["2022-04-01" 129.90 "Leroy Merlin" "Casa" "6655 6655 6655 6655"]
              ["2022-04-01" 150.90 "Madero" "Alimentação" "3939 3939 3939 3939"]])

(defn param-compras [] compras)
